let result = 'x ';

for (let i = 0; i < 11; i++) {
    for (let j = 0; j < 11; j++) {
        if(i == 0 && j > 0){
           result += '[' + j + ']';
        } 
        else if(j == 0 && i>0){
           result += '[' + i + '] ';
        } 
        else if(i>0 && j>0){
            result += (i*j) + ' ';
        }
    }
    result += '\n'
}

console.log(result);

document.write( 
    '2 x 1 = 2',
    '2 x 2 = 4',
    '2 x 3 = 6',
    '2 x 4 = 8',
    '2 x 5 = 10',
    '2 x 6 = 12',
    '2 x 7 = 14',
    '2 x 8 = 16',
    '2 x 9 = 18',
    '2 x 10 = 20',
);

document.write(
    '3 × 1 = 3',
    '3 × 2 = 6',
    '3 × 3 = 9',
    '3 × 4 = 12',
    '3 × 5 = 15',
    '3 × 6 = 18',
    '3 × 7 = 21',
    '3 × 8 = 24',
    '3 × 9 = 27',
    '3 × 10 = 30',
);

document.write(
    '4 × 1 = 4',
    '4 × 2 = 8',
    '4 × 3 = 12',
    '4 × 4 = 16',
    '4 × 5 = 20',
    '4 × 6 = 24',
    '4 × 7 = 28',
    '4 × 8 = 32',
    '4 × 9 = 36',
    '4 × 10 = 40',
);

document.write(
    '5 × 1 = 5',
    '5 × 2 = 10',
    '5 × 3 = 15',
    '5 × 4 = 20',
    '5 × 5 = 25',
    '5 × 6 = 30',
    '5 × 7 = 35',
    '5 × 8 = 40',
    '5 × 9 = 45',
    '5 × 10 = 50',
);

document.write(
    '6 × 1 = 6',
    '6 × 2 = 12',
    '6 × 3 = 18',
    '6 × 4 = 24',
    '6 × 5 = 30',
    '6 × 6 = 36',
    '6 × 7 = 42',
    '6 × 8 = 48',
    '6 × 9 = 54',
    '6 × 10 = 60',
);

document.write(
    '7 × 1 = 7',
    '7 × 2 = 14',
    '7 × 3 = 21',
    '7 × 4 = 28',
    '7 × 5 = 35',
    '7 × 6 = 42',
    '7 × 7 = 49',
    '7 × 8 = 56',
    '7 × 9 = 63',
    '7 × 10 = 70',
);

document.write(
    '8 × 1 = 8',
    '8 × 2 = 16',
    '8 × 3 = 24',
    '8 × 4 = 32',
    '8 × 5 = 40',
    '8 × 6 = 48',
    '8 × 7 = 56',
    '8 × 8 = 64',
    '8 × 9 = 72',
    '8 × 10 = 80',
);

document.write(
    '9 × 1 = 9',
    '9 × 2 = 18',
    '9 × 3 = 27',
    '9 × 4 = 36',
    '9 × 5 = 45',
    '9 × 6 = 54',
    '9 × 7 = 63',
    '9 × 8 = 72',
    '9 × 9 = 81',
    '9 × 10 = 90',
);

document.write(
    '10 × 1 = 10',
    '10 × 2 = 20',
    '10 × 3 = 30',
    '10 × 4 = 40',
    '10 × 5 = 50',
    '10 × 6 = 60',
    '10 × 7 = 70',
    '10 × 8 = 80',
    '10 × 9 = 90',
    '10 × 10 = 100',
);

const random = Math.floor(Math.random() * 4);

let computer = '';

let exit = false;

while (exit === 'exit') {
    const user = prompt('Anything');
    exit = user;
    
    if (random === 1) {
        computer = 'Камень';
    } else if (random === 2) {
        computer = 'Бумага';
    } else if (random === 3) {
        computer = 'Ножницы';
    }

    const v1 = user === 'Камень' && computer === 'Бумага';
    const v2 = user === 'Бумага' && computer === 'Ножницы';
    const v3 = user === 'Ножницы' && computer === 'Камень';

    if (user === computer) {
        alert('Ничья');
    } else if (v1 || v2 || v3) {
        alert('Комрьютер выиграл');
    } else {
        alert('Ты победил');
    }
}